---
kind: property
id: P:Autodesk.Revit.DB.DWFImportOptions.IsValidObject
source: html/2b10a5a0-07b1-36bb-0d2e-e2651cd0673f.htm
---
# Autodesk.Revit.DB.DWFImportOptions.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.